(function(){

	var patterns = [
		{'q':['はげしい','雨が','ふる'],'s':2,'v':3},
		{'q':['昨日は','あなたが','勝った'],'s':2,'v':3},
		{'q':['チョウが','花畑を','とぶ'],'s':1,'v':3},
		{'q':['きれいな','チョウが','とんでいる'],'s':2,'v':3},
		{'q':['カレーライスは','からあげよりも','からい'],'s':1,'v':3},
		{'q':['白組が','赤組に','勝った'],'s':1,'v':3},
		{'q':['父は','会社の','社長です'],'s':1,'v':3},
		{'q':['ゆめは','世界一の','選手です'],'s':1,'v':3},
		{'q':['日本は','アジアの','島国だ'],'s':1,'v':3},
		{'q':['昨日は','おやつを','買った'],'s':2,'v':3},
		{'q':['大事な','本が','ある'],'s':2,'v':3},
		{'q':['めずらしい','花が','ある'],'s':1,'v':1},
		{'q':['水族館に','サメが','いる'],'s':1,'v':1},
		{'q':['銀の','値段は','高い'],'s':1,'v':1},
		{'q':['イルカは','クジラよりも','小さい'],'s':1,'v':1},
		{'q':['チューリップの','花は','赤い'],'s':1,'v':1},
		{'q':['カブトムシの','足は','6本だ'],'s':1,'v':1},
		{'q':['出口は','あそこに','ある'],'s':1,'v':1},
		{'q':['きれいな','花が','さいた'],'s':1,'v':1},
		{'q':['木星は','ガスで','できた','わく星です'],'s':1,'v':1},
		{'q':['この','部屋は','とても','寒いです'],'s':1,'v':1},
		{'q':['これが','私が','かっている','犬だ'],'s':1,'v':1},
		{'q':['弟は','料理が','とても','とくいだ'],'s':1,'v':1},
		{'q':['私は','おどろいて','空を','見た'],'s':1,'v':1},
		{'q':['日曜日の','朝は','人が','少ない'],'s':1,'v':1},
		{'q':['人は','とても','かしこい','生き物だ'],'s':1,'v':1},
		{'q':['国語の','宿題は','とても','むずかしい'],'s':1,'v':1},
		{'q':['おいしい','お肉を','たくさん','たべたい'],'s':1,'v':1},
		{'q':['昼休みに','お腹が','とても','すいた'],'s':1,'v':1},
		{'q':['先生が','黒板に','字を','書く'],'s':1,'v':1},
		{'q':['小さくて','むらさき色の','花が','すみれだ'],'s':1,'v':1},



	];


	for(var i = patterns.length - 1; i > 0; i--){
		var r = Math.floor(Math.random() * (i + 1));
		var tmp = patterns[i];
		patterns[i] = patterns[r];
		patterns[r] = tmp;
	}
	var ret = [];
	for(var i = 0; i < 10; i++){
		ret.push({'mode':'normal','formula':patterns[i]})
	}
	return ret;
})();
